Revit 2026 API

# CylindricalHelixPitch Property

---

The pitch of the cylindrical helix.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Pitch { get; }
```
```vb
Public ReadOnly Property Pitch As Double
	Get
```
```cpp
public:
property double Pitch {
	double get ();
}
```
```fsharp
member Pitch : float with get
```

#### Property Value

Double

It is the distance moved along the axis direction when a point makes one rotation about the axis. Pitch can be positive or negative.

#### Reference

CylindricalHelix Class

Autodesk.Revit.DB Namespace